In [53]:
import pandas as pd
import numpy as np

In [54]:
df=pd.DataFrame({'col one':[1, 2], 'col two':[3, 4]})

In [42]:
# df=df.rename({'col one':'col_one', 'col two':'col_two'}, axis=1)

In [43]:
df=df.rename({'col one':'col_one'}, axis=1)

In [44]:
df

   col_one  col two
0        1        3
1        2        4

In [45]:
# df.columns=['col_one', 'col_two']

In [46]:
df

   col_one  col two
0        1        3
1        2        4

In [47]:
df.columns=df.columns.str.replace(' ', '_')

In [48]:
df

   col_one  col_two
0        1        3
1        2        4

In [49]:
df.add_prefix('X_')

   X_col_one  X_col_two
0          1          3
1          2          4

In [50]:
df.add_suffix('_Y')

   col_one_Y  col_two_Y
0          1          3
1          2          4

## Rename specific columns... like prefix and suffix to specific columns

In [55]:
new_names = [(i,i+'_x') for i in df.iloc[:, 1:].columns.values]
df.rename(columns = dict(new_names), inplace=True)

In [56]:
df

   col one  col two_x
0        1          3
1        2          4